---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FamilyCurveAttachmentProportion
source: html/f64d5e80-7358-fcd7-0975-376b509de927.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FamilyCurveAttachmentProportion Property

"Attachment Point"

## Syntax (C#)
```csharp
public static ForgeTypeId FamilyCurveAttachmentProportion { get; }
```